//============================================================
//
//	マップヘッダー [map.h]
//	Author：藤田勇一
//
//============================================================
//************************************************************
//	二重インクルード防止
//************************************************************
#ifndef _MAP_H_
#define _MAP_H_

//************************************************************
//	インクルードファイル
//************************************************************
#include "objectModel.h"

//************************************************************
//	クラス定義
//************************************************************
// マップクラス
class CMap : public CObjectModel
{
public:
	// コンストラクタ
	CMap();

	// デストラクタ
	~CMap() override;

	// オーバーライド関数
	HRESULT Init(void) override;	// 初期化
	void Uninit(void) override;		// 終了
	void Update(void) override;		// 更新
	void Draw(CShader *pShader = nullptr) override;	// 描画

	// 静的メンバ関数
	static CMap *Create	// 生成
	( // 引数
		const D3DXVECTOR3& rPos,			// 位置
		const D3DXVECTOR3& rRot = VEC3_ZERO	// 向き
	);
};

#endif	// _MAP_H_
