//============================================================
//
//	海ヘッダー [sea.h]
//	Author：藤田勇一
//
//============================================================
//************************************************************
//	二重インクルード防止
//************************************************************
#ifndef _SEA_H_
#define _SEA_H_

//************************************************************
//	インクルードファイル
//************************************************************
#include "main.h"
#include "object.h"

//************************************************************
//	前方宣言
//************************************************************
class CScrollMeshField;	// スクロールメッシュフィールドクラス

//************************************************************
//	クラス定義
//************************************************************
// 海クラス
class CSea : public CObject
{
public:
	// テクスチャ列挙
	typedef enum
	{
		TEXTURE_SEA000 = 0,	// 海(下)のテクスチャ
		TEXTURE_SEA001,		// 海(上)のテクスチャ
		TEXTURE_MAX			// この列挙型の総数
	}TEXTURE;

	// コンストラクタ
	CSea();

	// デストラクタ
	~CSea();

	// オーバーライド関数
	HRESULT Init(void);	// 初期化
	void Uninit(void);	// 終了
	void Update(void);	// 更新
	void Draw(void);	// 描画

	// 静的メンバ関数
	static CSea *Create(void);	// 生成

private:
	// 静的メンバ変数
	static const char *mc_apTextureFile[];	// テクスチャ定数

	// メンバ変数
	CScrollMeshField *m_apScrollMeshField[TEXTURE_MAX];	// スクロールメッシュフィールドの情報
	float m_fSinRot;	// 波打ち向き
};

#endif	// _SEA_H_
