//======================================================================================================================
//
//	コンテニューヘッダー [continue.h]
//	Author：藤田勇一
//
//======================================================================================================================
#ifndef _CONTINUE_H_	// このマクロ定義がされていない場合
#define _CONTINUE_H_	// 二重インクルード防止のマクロを定義する

//**********************************************************************************************************************
//	プロトタイプ宣言
//**********************************************************************************************************************
void InitContinue(void);								// コンテニューの初期化処理
void UninitContinue(void);								// コンテニューの終了処理
void UpdateContinue(float fAlpha, ALPHASTATE state);	// コンテニューの更新処理
void DrawContinue(float fAlpha);						// コンテニューの描画処理
void RevAlphaContinue(void);							// コンテニューのα値の補正処理

#endif