//======================================================================================================================
//
//	床ヘッダー [field.h]
//	Author：藤田勇一
//
//======================================================================================================================
#ifndef _FIELD_H_			// このマクロ定義がされていない場合
#define _FIELD_H_			// 二重インクルード防止のマクロを定義する

//**********************************************************************************************************************
//	プロトタイプ宣言
//**********************************************************************************************************************
void InitField(void);		// 床の初期化処理
void UninitField(void);		// 床の終了処理
void UpdateField(void);		// 床の更新処理
void DrawField(void);		// 床の描画処理
void SetField(D3DXVECTOR3 pos, D3DXVECTOR3 rot);	// 床の設定処理

#endif