//======================================================================================================================
//
//	ランキングヘッダー [ranking.h]
//	Author：藤田勇一
//
//======================================================================================================================
#ifndef _RANKING_H_					// このマクロ定義がされていない場合
#define _RANKING_H_					// 二重インクルード防止のマクロを定義する

//**********************************************************************************************************************
//	プロトタイプ宣言
//**********************************************************************************************************************
void InitRanking(void);				// ランキングの初期化処理
void UninitRanking(void);			// ランキングの終了処理
void UpdateRanking(float fAlpha);	// ランキングの更新処理
void DrawRanking(float fAlpha);		// ランキングの描画処理
void SetRanking(void);				// ランキングの設定処理

#endif