//======================================================================================================================
//
//	リザルトヘッダー [result.h]
//	Author：藤田勇一
//
//======================================================================================================================
#ifndef _RESULT_H_					// このマクロ定義がされていない場合
#define _RESULT_H_					// 二重インクルード防止のマクロを定義する

//**********************************************************************************************************************
//	プロトタイプ宣言
//**********************************************************************************************************************
void InitResult(void);				// リザルトの初期化処理
void UninitResult(void);			// リザルトの終了処理
void UpdateResult(float fAlpha);	// リザルトの更新処理
void DrawResult(float fAlpha);		// リザルトの描画処理
void SetTotalScore(void);			// トータルスコアの設定処理
int  GetTotalScore(void);			// トータルスコアの取得処理

#endif