//======================================================================================================================
//
//	サウンドヘッダー [sound.h]
//	Author：藤田勇一
//
//======================================================================================================================
#ifndef _SOUND_H_
#define _SOUND_H_

//**********************************************************************************************************************
//	インクルードファイル
//**********************************************************************************************************************
#include "main.h"

//**********************************************************************************************************************
//	列挙型定義 (SOUND_LABEL)
//**********************************************************************************************************************
typedef enum
{
	SOUND_LABEL_BGM_000 = 0,	// BGM (タイトル画面)
	SOUND_LABEL_BGM_001,		// BGM (チュートリアル画面)
	SOUND_LABEL_BGM_002,		// BGM (ゲーム画面)
	SOUND_LABEL_SE_MOVE,		// SE (カーソル移動)
	SOUND_LABEL_SE_DEC_00,		// SE (決定00)
	SOUND_LABEL_SE_DEC_01,		// SE (決定01)
	SOUND_LABEL_SE_RES_00,		// SE (リザルト移行00)
	SOUND_LABEL_SE_RES_01,		// SE (リザルト移行01)
	SOUND_LABEL_SE_JUMP,		// SE (ジャンプ)
	SOUND_LABEL_SE_SLASH,		// SE (斬撃)
	SOUND_LABEL_SE_SHOT,		// SE (発射)
	SOUND_LABEL_SE_REF,			// SE (反射)
	SOUND_LABEL_SE_SPAWN,		// SE (出現)
	SOUND_LABEL_SE_DMG,			// SE (ダメージ)
	SOUND_LABEL_SE_HEAL,		// SE (回復)
	SOUND_LABEL_SE_BREAK,		// SE (破壊)
	SOUND_LABEL_SE_DEATH,		// SE (死亡)
	SOUND_LABEL_MAX,			// この列挙型の総数
} SOUND_LABEL;

//**********************************************************************************************************************
//	プロトタイプ宣言
//**********************************************************************************************************************
HRESULT InitSound(HWND hWnd);			// サウンドの初期化処理
void UninitSound(void);					// サウンドの終了処理
HRESULT PlaySound(SOUND_LABEL label);	// サウンドの再生処理
void StopSound(SOUND_LABEL label);
void StopSound(void);

#endif
