//======================================================================================================================
//
//	竜巻ヘッダー [tornado.h]
//	Author：藤田勇一
//
//======================================================================================================================
#ifndef _TORNADO_H_	// このマクロ定義がされていない場合
#define _TORNADO_H_	// 二重インクルード防止のマクロを定義する

//**********************************************************************************************************************
//	列挙型定義 (TORNADOTYPE)
//**********************************************************************************************************************
typedef enum
{
	TORNADOTYPE_NORMAL = 0,	// 竜巻 (通常)
	TORNADOTYPE_MAX,		// この列挙型の総数
} TORNADOTYPE;

//**********************************************************************************************************************
//	プロトタイプ宣言
//**********************************************************************************************************************
void InitTornado(void);		// 竜巻の初期化処理
void UninitTornado(void);	// 竜巻の終了処理
void UpdateTornado(void);	// 竜巻の更新処理
void DrawTornado(void);		// 竜巻の描画処理

int SetTornado		// 竜巻の設定処理
(
	D3DXVECTOR3 pos,		// 位置
	D3DXVECTOR3 direRot,	// 成長向き
	TORNADOTYPE type,		// 種類
	D3DXMATRIX *pMtxParent,	// 親のマトリックス
	int   nNumAround,		// 渦の周回数
	int   nPattern,			// 渦の分割数
	float fMoveRot,			// 向きの変更量
	float fThickness,		// ポリゴンの太さ
	float fOuterPlus,		// ポリゴン外周の y座標加算量
	float fSetWidth,		// 生成時の横ずれ量
	float fSetAlpha,		// 生成時の透明度
	float fAddWidth,		// 横ずれの加算量
	float fAddHeight,		// 縦ずれの加算量
	float fSubAlpha,		// 透明度の減算量
	float fGrowWidth,		// 横ずれの成長量
	float fGrowHeight,		// 縦ずれの成長量
	float fGrowAlpha		// 透明度の成長量
);

void SetGrowTornado	// 竜巻の成長設定処理
(
	int   nID,			// 変更インデックス
	float fMoveRot,		// 向きの変更量
	float fGrowWidth,	// 横ずれの成長量
	float fGrowHeight,	// 縦ずれの成長量
	float fGrowAlpha	// 透明度の成長量
);

//**********************************************************************************************************************
//	プロトタイプ宣言 (デバッグ用)
//**********************************************************************************************************************

#endif