//======================================================================================================================
//
//	雑草ヘッダー [weed.h]
//	Author：藤田勇一
//
//======================================================================================================================
#ifndef _WEED_H_						// このマクロ定義がされていない場合
#define _WEED_H_						// 二重インクルード防止のマクロを定義する

//**********************************************************************************************************************
//	マクロ定義
//**********************************************************************************************************************
#define MAX_WEED		(256)			// 使用するポリゴン数 (雑草の最大数)

#define WEED_WIDTH		(25.0f)			// 雑草の横幅 / 2
#define WEED_HEIGHT		(45.0f)			// 雑草の縦幅
#define WEED_DEPTH		(25.0f)			// 雑草の奥行 / 2

#define WEED_SPAWN_REV	(60.0f)			// 雑草が生える位置の補正値

//**********************************************************************************************************************
//	構造体定義 (Weed)
//**********************************************************************************************************************
typedef struct
{
	D3DXVECTOR3 pos;					// 位置
	D3DXMATRIX  mtxWorld;				// ワールドマトリックス
	ACTIONSTATE state;					// 状態
	int         nGrowState;				// 成長状態
	int         nLife;					// 体力
	int         nCounterState;			// 状態管理カウンター
	int         nCounterGrow;			// 成長管理カウンター
	float       fWidth;					// 横幅
	float       fHeight;				// 縦幅
	int         nShadowID;				// 影のインデックス
	bool        bUse;					// 使用状況
}Weed;

//**********************************************************************************************************************
//	プロトタイプ宣言
//**********************************************************************************************************************
void InitWeed(void);					// 雑草の初期化処理
void UninitWeed(void);					// 雑草の終了処理
void UpdateWeed(void);					// 雑草の更新処理
void DrawWeed(void);					// 雑草の描画処理
void SetWeed(D3DXVECTOR3 pos);			// 雑草の設定処理
void HitWeed(Weed *pWeed, int nDamage);	// 雑草のダメージ判定
int  GetLeaveWeed(void);				// 雑草の余り数の取得処理
Weed *GetWeed(void);					// 雑草の取得処理

//**********************************************************************************************************************
//	プロトタイプ宣言 (デバッグ用)
//**********************************************************************************************************************
int GetNumWeed(void);					// 雑草の総数取得処理

#endif